app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
    def create
      user = User.create(user_params)